import { SubmitKey } from "../store/config";
import type { PartialLocaleType } from "./index";
import { getClientConfig } from "../config/client";
import { SAAS_CHAT_UTM_URL } from "@/app/constant";
const isApp = !!getClientConfig()?.isApp;

const ar: PartialLocaleType = {
  WIP: "Ù‚Ø±ÙŠØ¨Ù‹Ø§...",
  Error: {
    Unauthorized: isApp
      ? `ðŸ˜† ÙˆØ§Ø¬Ù‡Øª Ø§Ù„Ù…Ø­Ø§Ø¯Ø«Ø© Ø¨Ø¹Ø¶ Ø§Ù„Ù…Ø´ÙƒÙ„Ø§ØªØŒ Ù„Ø§ Ø¯Ø§Ø¹ÙŠ Ù„Ù„Ù‚Ù„Ù‚:
    \\ 1ï¸âƒ£ Ø¥Ø°Ø§ ÙƒÙ†Øª ØªØ±ØºØ¨ ÙÙŠ ØªØ¬Ø±Ø¨Ø© Ø¯ÙˆÙ† Ø¥Ø¹Ø¯Ø§Ø¯ØŒ [Ø§Ù†Ù‚Ø± Ù‡Ù†Ø§ Ù„Ø¨Ø¯Ø¡ Ø§Ù„Ù…Ø­Ø§Ø¯Ø«Ø© ÙÙˆØ±Ù‹Ø§ ðŸš€](${SAAS_CHAT_UTM_URL})
    \\ 2ï¸âƒ£ Ø¥Ø°Ø§ ÙƒÙ†Øª ØªØ±ÙŠØ¯ Ø§Ø³ØªØ®Ø¯Ø§Ù… Ù…ÙˆØ§Ø±Ø¯ OpenAI Ø§Ù„Ø®Ø§ØµØ© Ø¨ÙƒØŒ Ø§Ù†Ù‚Ø± [Ù‡Ù†Ø§](/#/settings) Ù„ØªØ¹Ø¯ÙŠÙ„ Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª âš™ï¸`
      : `ðŸ˜† ÙˆØ§Ø¬Ù‡Øª Ø§Ù„Ù…Ø­Ø§Ø¯Ø«Ø© Ø¨Ø¹Ø¶ Ø§Ù„Ù…Ø´ÙƒÙ„Ø§ØªØŒ Ù„Ø§ Ø¯Ø§Ø¹ÙŠ Ù„Ù„Ù‚Ù„Ù‚:
    \ 1ï¸âƒ£ Ø¥Ø°Ø§ ÙƒÙ†Øª ØªØ±ØºØ¨ ÙÙŠ ØªØ¬Ø±Ø¨Ø© Ø¯ÙˆÙ† Ø¥Ø¹Ø¯Ø§Ø¯ØŒ [Ø§Ù†Ù‚Ø± Ù‡Ù†Ø§ Ù„Ø¨Ø¯Ø¡ Ø§Ù„Ù…Ø­Ø§Ø¯Ø«Ø© ÙÙˆØ±Ù‹Ø§ ðŸš€](${SAAS_CHAT_UTM_URL})
    \ 2ï¸âƒ£ Ø¥Ø°Ø§ ÙƒÙ†Øª ØªØ³ØªØ®Ø¯Ù… Ø¥ØµØ¯Ø§Ø± Ø§Ù„Ù†Ø´Ø± Ø§Ù„Ø®Ø§ØµØŒ Ø§Ù†Ù‚Ø± [Ù‡Ù†Ø§](/#/auth) Ù„Ø¥Ø¯Ø®Ø§Ù„ Ù…ÙØªØ§Ø­ Ø§Ù„ÙˆØµÙˆÙ„ ðŸ”‘
    \ 3ï¸âƒ£ Ø¥Ø°Ø§ ÙƒÙ†Øª ØªØ±ÙŠØ¯ Ø§Ø³ØªØ®Ø¯Ø§Ù… Ù…ÙˆØ§Ø±Ø¯ OpenAI Ø§Ù„Ø®Ø§ØµØ© Ø¨ÙƒØŒ Ø§Ù†Ù‚Ø± [Ù‡Ù†Ø§](/#/settings) Ù„ØªØ¹Ø¯ÙŠÙ„ Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª âš™ï¸
 `,
  },
  Auth: {
    Title: "ØªØ­ØªØ§Ø¬ Ø¥Ù„Ù‰ ÙƒÙ„Ù…Ø© Ù…Ø±ÙˆØ±",
    Tips: "Ù‚Ø§Ù… Ø§Ù„Ù…Ø´Ø±Ù Ø¨ØªÙØ¹ÙŠÙ„ Ø§Ù„ØªØ­Ù‚Ù‚ Ø¨ÙƒÙ„Ù…Ø© Ø§Ù„Ù…Ø±ÙˆØ±ØŒ ÙŠØ±Ø¬Ù‰ Ø¥Ø¯Ø®Ø§Ù„ Ø±Ù…Ø² Ø§Ù„ÙˆØµÙˆÙ„ Ø£Ø¯Ù†Ø§Ù‡",
    SubTips: "Ø£Ùˆ Ø¥Ø¯Ø®Ø§Ù„ Ù…ÙØªØ§Ø­ API Ø§Ù„Ø®Ø§Øµ Ø¨Ù€ OpenAI Ø£Ùˆ Google",
    Input: "Ø£Ø¯Ø®Ù„ Ø±Ù…Ø² Ø§Ù„ÙˆØµÙˆÙ„ Ù‡Ù†Ø§",
    Confirm: "ØªØ£ÙƒÙŠØ¯",
    Later: "ÙÙŠ ÙˆÙ‚Øª Ù„Ø§Ø­Ù‚",
    Return: "Ø¹ÙˆØ¯Ø©",
    SaasTips: "Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª Ù…Ø¹Ù‚Ø¯Ø©ØŒ Ø£Ø±ÙŠØ¯ Ø§Ø³ØªØ®Ø¯Ø§Ù…Ù‡ Ø¹Ù„Ù‰ Ø§Ù„ÙÙˆØ±",
    TopTips:
      "ðŸ¥³ Ø¹Ø±Ø¶ HeyChat AI Ø§Ù„Ø£ÙˆÙ„ØŒ Ø§ÙØªØ­ Ø§Ù„Ø¢Ù† OpenAI o1, GPT-4o, Claude-3.5 ÙˆØ£Ø­Ø¯Ø« Ø§Ù„Ù†Ù…Ø§Ø°Ø¬ Ø§Ù„ÙƒØ¨ÙŠØ±Ø©",
  },
  ChatItem: {
    ChatItemCount: (count: number) => `${count} Ù…Ø­Ø§Ø¯Ø«Ø©`,
  },
  Chat: {
    SubTitle: (count: number) => `Ø¥Ø¬Ù…Ø§Ù„ÙŠ ${count} Ù…Ø­Ø§Ø¯Ø«Ø©`,
    EditMessage: {
      Title: "ØªØ­Ø±ÙŠØ± Ø³Ø¬Ù„ Ø§Ù„Ø±Ø³Ø§Ø¦Ù„",
      Topic: {
        Title: "Ù…ÙˆØ¶ÙˆØ¹ Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
        SubTitle: "ØªØºÙŠÙŠØ± Ù…ÙˆØ¶ÙˆØ¹ Ø§Ù„Ø¯Ø±Ø¯Ø´Ø© Ø§Ù„Ø­Ø§Ù„ÙŠ",
      },
    },
    Actions: {
      ChatList: "Ø¹Ø±Ø¶ Ù‚Ø§Ø¦Ù…Ø© Ø§Ù„Ø±Ø³Ø§Ø¦Ù„",
      CompressedHistory: "Ø¹Ø±Ø¶ Ø§Ù„ØªØ§Ø±ÙŠØ® Ø§Ù„Ù…Ø¶ØºÙˆØ·",
      Export: "ØªØµØ¯ÙŠØ± Ø³Ø¬Ù„ Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
      Copy: "Ù†Ø³Ø®",
      Stop: "Ø¥ÙŠÙ‚Ø§Ù",
      Retry: "Ø¥Ø¹Ø§Ø¯Ø© Ø§Ù„Ù…Ø­Ø§ÙˆÙ„Ø©",
      Pin: "ØªØ«Ø¨ÙŠØª",
      PinToastContent: "ØªÙ… ØªØ«Ø¨ÙŠØª 1 Ù…Ø­Ø§Ø¯Ø«Ø© ÙÙŠ Ø§Ù„Ø¥Ø´Ø¹Ø§Ø±Ø§Øª Ø§Ù„Ù…Ø³Ø¨Ù‚Ø©",
      PinToastAction: "Ø¹Ø±Ø¶",
      Delete: "Ø­Ø°Ù",
      Edit: "ØªØ­Ø±ÙŠØ±",
      RefreshTitle: "ØªØ­Ø¯ÙŠØ« Ø§Ù„Ø¹Ù†ÙˆØ§Ù†",
      RefreshToast: "ØªÙ… Ø¥Ø±Ø³Ø§Ù„ Ø·Ù„Ø¨ ØªØ­Ø¯ÙŠØ« Ø§Ù„Ø¹Ù†ÙˆØ§Ù†",
    },
    Commands: {
      new: "Ø¯Ø±Ø¯Ø´Ø© Ø¬Ø¯ÙŠØ¯Ø©",
      newm: "Ø¥Ù†Ø´Ø§Ø¡ Ø¯Ø±Ø¯Ø´Ø© Ù…Ù† Ø§Ù„Ù‚Ù†Ø§Ø¹",
      next: "Ø§Ù„Ø¯Ø±Ø¯Ø´Ø© Ø§Ù„ØªØ§Ù„ÙŠØ©",
      prev: "Ø§Ù„Ø¯Ø±Ø¯Ø´Ø© Ø§Ù„Ø³Ø§Ø¨Ù‚Ø©",
      clear: "Ù…Ø³Ø­ Ø§Ù„Ø³ÙŠØ§Ù‚",
      del: "Ø­Ø°Ù Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
    },
    InputActions: {
      Stop: "Ø¥ÙŠÙ‚Ø§Ù Ø§Ù„Ø§Ø³ØªØ¬Ø§Ø¨Ø©",
      ToBottom: "Ø§Ù„Ø§Ù†ØªÙ‚Ø§Ù„ Ø¥Ù„Ù‰ Ø§Ù„Ø£Ø­Ø¯Ø«",
      Theme: {
        auto: "Ù…ÙˆØ¶ÙˆØ¹ ØªÙ„Ù‚Ø§Ø¦ÙŠ",
        light: "Ø§Ù„ÙˆØ¶Ø¹ Ø§Ù„ÙØ§ØªØ­",
        dark: "Ø§Ù„ÙˆØ¶Ø¹ Ø§Ù„Ø¯Ø§ÙƒÙ†",
      },
      Prompt: "Ø§Ù„Ø£ÙˆØ§Ù…Ø± Ø§Ù„Ø³Ø±ÙŠØ¹Ø©",
      Masks: "Ø¬Ù…ÙŠØ¹ Ø§Ù„Ø£Ù‚Ù†Ø¹Ø©",
      Clear: "Ù…Ø³Ø­ Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
      Settings: "Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
      UploadImage: "ØªØ­Ù…ÙŠÙ„ ØµÙˆØ±Ø©",
    },
    Rename: "Ø¥Ø¹Ø§Ø¯Ø© ØªØ³Ù…ÙŠØ© Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
    Typing: "ÙŠÙƒØªØ¨â€¦",
    Input: (submitKey: string) => {
      var inputHints = `${submitKey} Ø¥Ø±Ø³Ø§Ù„`;
      if (submitKey === String(SubmitKey.Enter)) {
        inputHints += "ØŒ Shift + Enter Ù„Ø¥Ø¯Ø±Ø§Ø¬ Ø³Ø·Ø± Ø¬Ø¯ÙŠØ¯";
      }
      return inputHints + "ØŒ / Ù„ØªÙØ¹ÙŠÙ„ Ø§Ù„Ø¥ÙƒÙ…Ø§Ù„ Ø§Ù„ØªÙ„Ù‚Ø§Ø¦ÙŠØŒ : Ù„ØªÙØ¹ÙŠÙ„ Ø§Ù„Ø£ÙˆØ§Ù…Ø±";
    },
    Send: "Ø¥Ø±Ø³Ø§Ù„",
    Config: {
      Reset: "Ù…Ø³Ø­ Ø§Ù„Ø°Ø§ÙƒØ±Ø©",
      SaveAs: "Ø­ÙØ¸ ÙƒÙ‚Ù†Ø§Ø¹",
    },
    IsContext: "Ø§Ù„Ø¥Ø´Ø¹Ø§Ø±Ø§Øª Ø§Ù„Ù…Ø³Ø¨Ù‚Ø©",
  },
  Export: {
    Title: "Ù…Ø´Ø§Ø±ÙƒØ© Ø³Ø¬Ù„ Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
    Copy: "Ù†Ø³Ø® Ø§Ù„ÙƒÙ„",
    Download: "ØªØ­Ù…ÙŠÙ„ Ø§Ù„Ù…Ù„Ù",
    Share: "Ù…Ø´Ø§Ø±ÙƒØ© Ø¹Ù„Ù‰ ShareGPT",
    MessageFromYou: "Ø§Ù„Ù…Ø³ØªØ®Ø¯Ù…",
    MessageFromChatGPT: "ChatGPT",
    Format: {
      Title: "ØªÙ†Ø³ÙŠÙ‚ Ø§Ù„ØªØµØ¯ÙŠØ±",
      SubTitle: "ÙŠÙ…ÙƒÙ†Ùƒ ØªØµØ¯ÙŠØ± Ø§Ù„Ù†Øµ ÙƒÙ€ Markdown Ø£Ùˆ ØµÙˆØ±Ø© PNG",
    },
    IncludeContext: {
      Title: "ØªØ¶Ù…ÙŠÙ† Ø³ÙŠØ§Ù‚ Ø§Ù„Ù‚Ù†Ø§Ø¹",
      SubTitle: "Ù‡Ù„ ØªØ±ÙŠØ¯ Ø¹Ø±Ø¶ Ø³ÙŠØ§Ù‚ Ø§Ù„Ù‚Ù†Ø§Ø¹ ÙÙŠ Ø§Ù„Ø±Ø³Ø§Ø¦Ù„",
    },
    Steps: {
      Select: "Ø§Ø®ØªÙŠØ§Ø±",
      Preview: "Ù…Ø¹Ø§ÙŠÙ†Ø©",
    },
    Image: {
      Toast: "ÙŠØªÙ… Ø¥Ù†Ø´Ø§Ø¡ Ù„Ù‚Ø·Ø© Ø§Ù„Ø´Ø§Ø´Ø©",
      Modal: "Ø§Ø¶ØºØ· Ù…Ø·ÙˆÙ„Ø§Ù‹ Ø£Ùˆ Ø§Ù†Ù‚Ø± Ø¨Ø²Ø± Ø§Ù„Ù…Ø§ÙˆØ³ Ø§Ù„Ø£ÙŠÙ…Ù† Ù„Ø­ÙØ¸ Ø§Ù„ØµÙˆØ±Ø©",
    },
  },
  Select: {
    Search: "Ø¨Ø­Ø« ÙÙŠ Ø§Ù„Ø±Ø³Ø§Ø¦Ù„",
    All: "ØªØ­Ø¯ÙŠØ¯ Ø§Ù„ÙƒÙ„",
    Latest: "Ø£Ø­Ø¯Ø« Ø§Ù„Ø±Ø³Ø§Ø¦Ù„",
    Clear: "Ù…Ø³Ø­ Ø§Ù„ØªØ­Ø¯ÙŠØ¯",
  },
  Memory: {
    Title: "Ù…Ù„Ø®Øµ Ø§Ù„ØªØ§Ø±ÙŠØ®",
    EmptyContent: "Ù…Ø­ØªÙˆÙ‰ Ø§Ù„Ù…Ø­Ø§Ø¯Ø«Ø© Ù‚ØµÙŠØ± Ø¬Ø¯Ø§Ù‹ØŒ Ù„Ø§ Ø­Ø§Ø¬Ø© Ù„Ù„ØªÙ„Ø®ÙŠØµ",
    Send: "Ø¶ØºØ· ØªÙ„Ù‚Ø§Ø¦ÙŠ Ù„Ø³Ø¬Ù„ Ø§Ù„Ø¯Ø±Ø¯Ø´Ø© ÙƒÙ€ Ø³ÙŠØ§Ù‚",
    Copy: "Ù†Ø³Ø® Ø§Ù„Ù…Ù„Ø®Øµ",
    Reset: "[ØºÙŠØ± Ù…Ø³ØªØ®Ø¯Ù…]",
    ResetConfirm: "ØªØ£ÙƒÙŠØ¯ Ù…Ø³Ø­ Ù…Ù„Ø®Øµ Ø§Ù„ØªØ§Ø±ÙŠØ®ØŸ",
  },
  Home: {
    NewChat: "Ø¯Ø±Ø¯Ø´Ø© Ø¬Ø¯ÙŠØ¯Ø©",
    DeleteChat: "ØªØ£ÙƒÙŠØ¯ Ø­Ø°Ù Ø§Ù„Ù…Ø­Ø§Ø¯Ø«Ø© Ø§Ù„Ù…Ø­Ø¯Ø¯Ø©ØŸ",
    DeleteToast: "ØªÙ… Ø­Ø°Ù Ø§Ù„Ù…Ø­Ø§Ø¯Ø«Ø©",
    Revert: "ØªØ±Ø§Ø¬Ø¹",
  },
  Settings: {
    Title: "Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª",
    SubTitle: "Ø¬Ù…ÙŠØ¹ Ø®ÙŠØ§Ø±Ø§Øª Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª",

    Danger: {
      Reset: {
        Title: "Ø¥Ø¹Ø§Ø¯Ø© ØªØ¹ÙŠÙŠÙ† Ø¬Ù…ÙŠØ¹ Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª",
        SubTitle: "Ø¥Ø¹Ø§Ø¯Ø© ØªØ¹ÙŠÙŠÙ† Ø¬Ù…ÙŠØ¹ Ø¹Ù†Ø§ØµØ± Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª Ø¥Ù„Ù‰ Ø§Ù„Ù‚ÙŠÙ… Ø§Ù„Ø§ÙØªØ±Ø§Ø¶ÙŠØ©",
        Action: "Ø¥Ø¹Ø§Ø¯Ø© Ø§Ù„ØªØ¹ÙŠÙŠÙ† Ø§Ù„Ø¢Ù†",
        Confirm: "ØªØ£ÙƒÙŠØ¯ Ø¥Ø¹Ø§Ø¯Ø© ØªØ¹ÙŠÙŠÙ† Ø¬Ù…ÙŠØ¹ Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§ØªØŸ",
      },
      Clear: {
        Title: "Ù…Ø³Ø­ Ø¬Ù…ÙŠØ¹ Ø§Ù„Ø¨ÙŠØ§Ù†Ø§Øª",
        SubTitle: "Ù…Ø³Ø­ Ø¬Ù…ÙŠØ¹ Ø§Ù„Ø¯Ø±Ø¯Ø´Ø§Øª ÙˆØ¨ÙŠØ§Ù†Ø§Øª Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª",
        Action: "Ù…Ø³Ø­ Ø§Ù„Ø¢Ù†",
        Confirm: "ØªØ£ÙƒÙŠØ¯ Ù…Ø³Ø­ Ø¬Ù…ÙŠØ¹ Ø§Ù„Ø¯Ø±Ø¯Ø´Ø§Øª ÙˆØ¨ÙŠØ§Ù†Ø§Øª Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§ØªØŸ",
      },
    },
    Lang: {
      Name: "Language", // Ø§Ù†ØªØ¨Ù‡: Ø¥Ø°Ø§ ÙƒÙ†Øª ØªØ±ØºØ¨ ÙÙŠ Ø¥Ø¶Ø§ÙØ© ØªØ±Ø¬Ù…Ø© Ø¬Ø¯ÙŠØ¯Ø©ØŒ ÙŠØ±Ø¬Ù‰ Ø¹Ø¯Ù… ØªØ±Ø¬Ù…Ø© Ù‡Ø°Ù‡ Ø§Ù„Ù‚ÙŠÙ…Ø©ØŒ Ø§ØªØ±ÙƒÙ‡Ø§ ÙƒÙ…Ø§ Ù‡ÙŠ "Language"
      All: "Ø¬Ù…ÙŠØ¹ Ø§Ù„Ù„ØºØ§Øª",
    },
    Avatar: "Ø§Ù„ØµÙˆØ±Ø© Ø§Ù„Ø´Ø®ØµÙŠØ©",
    FontSize: {
      Title: "Ø­Ø¬Ù… Ø§Ù„Ø®Ø·",
      SubTitle: "Ø­Ø¬Ù… Ø§Ù„Ø®Ø· ÙÙŠ Ù…Ø­ØªÙˆÙ‰ Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
    },
    FontFamily: {
      Title: "Ø®Ø· Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
      SubTitle: "Ø®Ø· Ù…Ø­ØªÙˆÙ‰ Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©ØŒ Ø§ØªØ±ÙƒÙ‡ ÙØ§Ø±ØºÙ‹Ø§ Ù„ØªØ·Ø¨ÙŠÙ‚ Ø§Ù„Ø®Ø· Ø§Ù„Ø§ÙØªØ±Ø§Ø¶ÙŠ Ø§Ù„Ø¹Ø§Ù„Ù…ÙŠ",
      Placeholder: "Ø§Ø³Ù… Ø§Ù„Ø®Ø·",
    },
    InjectSystemPrompts: {
      Title: "Ø­Ù‚Ù† Ø§Ù„Ø±Ø³Ø§Ø¦Ù„ Ø§Ù„Ù†ØµÙŠØ© Ø§Ù„Ù†Ø¸Ø§Ù…ÙŠØ©",
      SubTitle:
        "ÙØ±Ø¶ Ø¥Ø¶Ø§ÙØ© Ø±Ø³Ø§Ù„Ø© Ù†Ø¸Ø§Ù…ÙŠØ© ØªØ­Ø§ÙƒÙŠ ChatGPT ÙÙŠ Ø¨Ø¯Ø§ÙŠØ© Ù‚Ø§Ø¦Ù…Ø© Ø§Ù„Ø±Ø³Ø§Ø¦Ù„ Ù„ÙƒÙ„ Ø·Ù„Ø¨",
    },
    InputTemplate: {
      Title: "Ù…Ø¹Ø§Ù„Ø¬Ø© Ø§Ù„Ø¥Ø¯Ø®Ø§Ù„ Ù…Ù† Ù‚Ø¨Ù„ Ø§Ù„Ù…Ø³ØªØ®Ø¯Ù…",
      SubTitle: "Ø³ÙŠØªÙ… Ù…Ù„Ø¡ Ø¢Ø®Ø± Ø±Ø³Ø§Ù„Ø© Ù…Ù† Ø§Ù„Ù…Ø³ØªØ®Ø¯Ù… ÙÙŠ Ù‡Ø°Ø§ Ø§Ù„Ù‚Ø§Ù„Ø¨",
    },

    Update: {
      Version: (x: string) => `Ø§Ù„Ø¥ØµØ¯Ø§Ø± Ø§Ù„Ø­Ø§Ù„ÙŠ: ${x}`,
      IsLatest: "Ø£Ù†Øª Ø¹Ù„Ù‰ Ø£Ø­Ø¯Ø« Ø¥ØµØ¯Ø§Ø±",
      CheckUpdate: "Ø§Ù„ØªØ­Ù‚Ù‚ Ù…Ù† Ø§Ù„ØªØ­Ø¯ÙŠØ«Ø§Øª",
      IsChecking: "Ø¬Ø§Ø±Ù Ø§Ù„ØªØ­Ù‚Ù‚ Ù…Ù† Ø§Ù„ØªØ­Ø¯ÙŠØ«Ø§Øª...",
      FoundUpdate: (x: string) => `ØªÙ… Ø§Ù„Ø¹Ø«ÙˆØ± Ø¹Ù„Ù‰ Ø¥ØµØ¯Ø§Ø± Ø¬Ø¯ÙŠØ¯: ${x}`,
      GoToUpdate: "Ø§Ù†ØªÙ‚Ù„ Ù„Ù„ØªØ­Ø¯ÙŠØ«",
    },
    SendKey: "Ø²Ø± Ø§Ù„Ø¥Ø±Ø³Ø§Ù„",
    Theme: "Ø§Ù„Ø³Ù…Ø©",
    TightBorder: "ÙˆØ¶Ø¹ Ø¨Ø¯ÙˆÙ† Ø­Ø¯ÙˆØ¯",
    SendPreviewBubble: {
      Title: "ÙÙ‚Ø§Ø¹Ø© Ø§Ù„Ù…Ø¹Ø§ÙŠÙ†Ø©",
      SubTitle: "Ù…Ø¹Ø§ÙŠÙ†Ø© Ù…Ø­ØªÙˆÙ‰ Markdown ÙÙŠ ÙÙ‚Ø§Ø¹Ø© Ø§Ù„Ù…Ø¹Ø§ÙŠÙ†Ø©",
    },
    AutoGenerateTitle: {
      Title: "ØªÙˆÙ„ÙŠØ¯ Ø§Ù„Ø¹Ù†ÙˆØ§Ù† ØªÙ„Ù‚Ø§Ø¦ÙŠÙ‹Ø§",
      SubTitle: "ØªÙˆÙ„ÙŠØ¯ Ø¹Ù†ÙˆØ§Ù† Ù…Ù†Ø§Ø³Ø¨ Ø¨Ù†Ø§Ø¡Ù‹ Ø¹Ù„Ù‰ Ù…Ø­ØªÙˆÙ‰ Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
    },
    Sync: {
      CloudState: "Ø¨ÙŠØ§Ù†Ø§Øª Ø§Ù„Ø³Ø­Ø§Ø¨Ø©",
      NotSyncYet: "Ù„Ù… ÙŠØªÙ… Ø§Ù„ØªØ²Ø§Ù…Ù† Ø¨Ø¹Ø¯",
      Success: "ØªÙ… Ø§Ù„ØªØ²Ø§Ù…Ù† Ø¨Ù†Ø¬Ø§Ø­",
      Fail: "ÙØ´Ù„ Ø§Ù„ØªØ²Ø§Ù…Ù†",

      Config: {
        Modal: {
          Title: "ØªÙƒÙˆÙŠÙ† Ø§Ù„ØªØ²Ø§Ù…Ù† Ø§Ù„Ø³Ø­Ø§Ø¨ÙŠ",
          Check: "Ø§Ù„ØªØ­Ù‚Ù‚ Ù…Ù† Ø§Ù„ØªÙˆÙØ±",
        },
        SyncType: {
          Title: "Ù†ÙˆØ¹ Ø§Ù„ØªØ²Ø§Ù…Ù†",
          SubTitle: "Ø§Ø®ØªØ± Ø®Ø§Ø¯Ù… Ø§Ù„ØªØ²Ø§Ù…Ù† Ø§Ù„Ù…ÙØ¶Ù„",
        },
        Proxy: {
          Title: "ØªÙØ¹ÙŠÙ„ Ø§Ù„ÙˆÙƒÙŠÙ„",
          SubTitle: "ÙŠØ¬Ø¨ ØªÙØ¹ÙŠÙ„ Ø§Ù„ÙˆÙƒÙŠÙ„ Ø¹Ù†Ø¯ Ø§Ù„ØªØ²Ø§Ù…Ù† Ø¹Ø¨Ø± Ø§Ù„Ù…ØªØµÙØ­ Ù„ØªØ¬Ù†Ø¨ Ù‚ÙŠÙˆØ¯ CORS",
        },
        ProxyUrl: {
          Title: "Ø¹Ù†ÙˆØ§Ù† Ø§Ù„ÙˆÙƒÙŠÙ„",
          SubTitle: "ÙŠÙ†Ø·Ø¨Ù‚ ÙÙ‚Ø· Ø¹Ù„Ù‰ Ø§Ù„ÙˆÙƒÙŠÙ„ Ø§Ù„Ù…ØªØ§Ø­ ÙÙŠ Ù‡Ø°Ø§ Ø§Ù„Ù…Ø´Ø±ÙˆØ¹",
        },

        WebDav: {
          Endpoint: "Ø¹Ù†ÙˆØ§Ù† WebDAV",
          UserName: "Ø§Ø³Ù… Ø§Ù„Ù…Ø³ØªØ®Ø¯Ù…",
          Password: "ÙƒÙ„Ù…Ø© Ø§Ù„Ù…Ø±ÙˆØ±",
        },

        UpStash: {
          Endpoint: "Ø±Ø§Ø¨Ø· UpStash Redis REST",
          UserName: "Ø§Ø³Ù… Ø§Ù„Ù†Ø³Ø® Ø§Ù„Ø§Ø­ØªÙŠØ§Ø·ÙŠ",
          Password: "Ø±Ù…Ø² UpStash Redis REST",
        },
      },

      LocalState: "Ø¨ÙŠØ§Ù†Ø§Øª Ù…Ø­Ù„ÙŠØ©",
      Overview: (overview: any) => {
        return `${overview.chat} Ø¯Ø±Ø¯Ø´Ø©ØŒ ${overview.message} Ø±Ø³Ø§Ù„Ø©ØŒ ${overview.prompt} Ø¥Ø´Ø¹Ø§Ø±ØŒ ${overview.mask} Ù‚Ù†Ø§Ø¹`;
      },
      ImportFailed: "ÙØ´Ù„ Ø§Ù„Ø§Ø³ØªÙŠØ±Ø§Ø¯",
    },
    Mask: {
      Splash: {
        Title: "ØµÙØ­Ø© Ø¨Ø¯Ø¡ Ø§Ù„Ù‚Ù†Ø§Ø¹",
        SubTitle: "Ø¹Ø±Ø¶ ØµÙØ­Ø© Ø¨Ø¯Ø¡ Ø§Ù„Ù‚Ù†Ø§Ø¹ Ø¹Ù†Ø¯ Ø¨Ø¯Ø¡ Ø¯Ø±Ø¯Ø´Ø© Ø¬Ø¯ÙŠØ¯Ø©",
      },
      Builtin: {
        Title: "Ø¥Ø®ÙØ§Ø¡ Ø§Ù„Ø£Ù‚Ù†Ø¹Ø© Ø§Ù„Ù…Ø¯Ù…Ø¬Ø©",
        SubTitle: "Ø¥Ø®ÙØ§Ø¡ Ø§Ù„Ø£Ù‚Ù†Ø¹Ø© Ø§Ù„Ù…Ø¯Ù…Ø¬Ø© ÙÙŠ Ù‚Ø§Ø¦Ù…Ø© Ø§Ù„Ø£Ù‚Ù†Ø¹Ø©",
      },
    },
    Prompt: {
      Disable: {
        Title: "ØªØ¹Ø·ÙŠÙ„ Ø§Ù„Ø¥ÙƒÙ…Ø§Ù„ Ø§Ù„ØªÙ„Ù‚Ø§Ø¦ÙŠ Ù„Ù„Ø¥Ø´Ø¹Ø§Ø±Ø§Øª",
        SubTitle: "Ø§Ø³ØªØ®Ø¯Ù… / ÙÙŠ Ø¨Ø¯Ø§ÙŠØ© Ù…Ø±Ø¨Ø¹ Ø§Ù„Ù†Øµ Ù„ØªÙØ¹ÙŠÙ„ Ø§Ù„Ø¥ÙƒÙ…Ø§Ù„ Ø§Ù„ØªÙ„Ù‚Ø§Ø¦ÙŠ",
      },
      List: "Ù‚Ø§Ø¦Ù…Ø© Ø§Ù„Ø¥Ø´Ø¹Ø§Ø±Ø§Øª Ø§Ù„Ù…Ø®ØµØµØ©",
      ListCount: (builtin: number, custom: number) =>
        `Ù…Ø¯Ù…Ø¬ ${builtin} Ø¥Ø´Ø¹Ø§Ø±ØŒ Ù…Ø®ØµØµ ${custom} Ø¥Ø´Ø¹Ø§Ø±`,
      Edit: "ØªØ­Ø±ÙŠØ±",
      Modal: {
        Title: "Ù‚Ø§Ø¦Ù…Ø© Ø§Ù„Ø¥Ø´Ø¹Ø§Ø±Ø§Øª",
        Add: "Ø¬Ø¯ÙŠØ¯",
        Search: "Ø¨Ø­Ø« Ø¹Ù† Ø¥Ø´Ø¹Ø§Ø±Ø§Øª",
      },
      EditModal: {
        Title: "ØªØ­Ø±ÙŠØ± Ø§Ù„Ø¥Ø´Ø¹Ø§Ø±Ø§Øª",
      },
    },
    HistoryCount: {
      Title: "Ø¹Ø¯Ø¯ Ø§Ù„Ø±Ø³Ø§Ø¦Ù„ Ø§Ù„ØªØ§Ø±ÙŠØ®ÙŠØ© Ø§Ù„Ù…Ø±ÙÙ‚Ø©",
      SubTitle: "Ø¹Ø¯Ø¯ Ø§Ù„Ø±Ø³Ø§Ø¦Ù„ Ø§Ù„ØªØ§Ø±ÙŠØ®ÙŠØ© Ø§Ù„Ù…Ø±ÙÙ‚Ø© Ù…Ø¹ ÙƒÙ„ Ø·Ù„Ø¨",
    },
    CompressThreshold: {
      Title: "Ø¹ØªØ¨Ø© Ø¶ØºØ· Ø·ÙˆÙ„ Ø§Ù„Ø±Ø³Ø§Ø¦Ù„ Ø§Ù„ØªØ§Ø±ÙŠØ®ÙŠØ©",
      SubTitle:
        "Ø¹Ù†Ø¯Ù…Ø§ ÙŠØªØ¬Ø§ÙˆØ² Ø·ÙˆÙ„ Ø§Ù„Ø±Ø³Ø§Ø¦Ù„ Ø§Ù„ØªØ§Ø±ÙŠØ®ÙŠØ© ØºÙŠØ± Ø§Ù„Ù…Ø¶ØºÙˆØ·Ø© Ù‡Ø°Ù‡ Ø§Ù„Ù‚ÙŠÙ…Ø©ØŒ Ø³ÙŠØªÙ… Ø§Ù„Ø¶ØºØ·",
    },

    Usage: {
      Title: "Ø§Ù„ØªØ­Ù‚Ù‚ Ù…Ù† Ø§Ù„Ø±ØµÙŠØ¯",
      SubTitle(used: any, total: any) {
        return `ØªÙ… Ø§Ø³ØªØ®Ø¯Ø§Ù… $${used} Ù‡Ø°Ø§ Ø§Ù„Ø´Ù‡Ø±ØŒ Ø¥Ø¬Ù…Ø§Ù„ÙŠ Ø§Ù„Ø§Ø´ØªØ±Ø§Ùƒ $${total}`;
      },
      IsChecking: "Ø¬Ø§Ø±Ù Ø§Ù„ØªØ­Ù‚Ù‚...",
      Check: "Ø¥Ø¹Ø§Ø¯Ø© Ø§Ù„ØªØ­Ù‚Ù‚",
      NoAccess: "Ø£Ø¯Ø®Ù„ Ù…ÙØªØ§Ø­ API Ø£Ùˆ ÙƒÙ„Ù…Ø© Ù…Ø±ÙˆØ± Ù„Ù„ÙˆØµÙˆÙ„ Ø¥Ù„Ù‰ Ø§Ù„Ø±ØµÙŠØ¯",
    },

    Access: {
      SaasStart: {
        Title: "Ø§Ø³ØªØ®Ø¯Ø§Ù… HeyChat AI",
        Label: "(Ø£ÙØ¶Ù„ Ø­Ù„ Ù…Ù† Ø­ÙŠØ« Ø§Ù„ØªÙƒÙ„ÙØ©)",
        SubTitle:
          "Ù…Ø¯Ø¹ÙˆÙ… Ø±Ø³Ù…ÙŠÙ‹Ø§ Ù…Ù† HeyChatØŒ Ø¬Ø§Ù‡Ø² Ù„Ù„Ø§Ø³ØªØ®Ø¯Ø§Ù… Ø¨Ø¯ÙˆÙ† Ø¥Ø¹Ø¯Ø§Ø¯ØŒ ÙŠØ¯Ø¹Ù… Ø£Ø­Ø¯Ø« Ø§Ù„Ù†Ù…Ø§Ø°Ø¬ Ø§Ù„ÙƒØ¨ÙŠØ±Ø© Ù…Ø«Ù„ OpenAI o1 Ùˆ GPT-4o Ùˆ Claude-3.5",
        ChatNow: "Ø§Ù„Ø¯Ø±Ø¯Ø´Ø© Ø§Ù„Ø¢Ù†",
      },
      AccessCode: {
        Title: "ÙƒÙ„Ù…Ø© Ø§Ù„Ù…Ø±ÙˆØ± Ù„Ù„ÙˆØµÙˆÙ„",
        SubTitle: "Ù‚Ø§Ù… Ø§Ù„Ù…Ø´Ø±Ù Ø¨ØªÙ…ÙƒÙŠÙ† Ø§Ù„ÙˆØµÙˆÙ„ Ø§Ù„Ù…Ø´ÙØ±",
        Placeholder: "Ø£Ø¯Ø®Ù„ ÙƒÙ„Ù…Ø© Ø§Ù„Ù…Ø±ÙˆØ± Ù„Ù„ÙˆØµÙˆÙ„",
      },
      CustomEndpoint: {
        Title: "ÙˆØ§Ø¬Ù‡Ø© Ù…Ø®ØµØµØ©",
        SubTitle: "Ù‡Ù„ ØªØ³ØªØ®Ø¯Ù… Ø®Ø¯Ù…Ø© Azure Ø£Ùˆ OpenAI Ù…Ø®ØµØµØ©",
      },
      Provider: {
        Title: "Ù…ÙˆÙØ± Ø§Ù„Ø®Ø¯Ù…Ø© Ø§Ù„Ù†Ù…ÙˆØ°Ø¬ÙŠØ©",
        SubTitle: "Ø§Ù„ØªØ¨Ø¯ÙŠÙ„ Ø¨ÙŠÙ† Ù…Ù‚Ø¯Ù…ÙŠ Ø§Ù„Ø®Ø¯Ù…Ø© Ø§Ù„Ù…Ø®ØªÙ„ÙÙŠÙ†",
      },
      OpenAI: {
        ApiKey: {
          Title: "Ù…ÙØªØ§Ø­ API",
          SubTitle: "Ø§Ø³ØªØ®Ø¯Ù… Ù…ÙØªØ§Ø­ OpenAI Ù…Ø®ØµØµ Ù„ØªØ¬Ø§ÙˆØ² Ù‚ÙŠÙˆØ¯ ÙƒÙ„Ù…Ø© Ø§Ù„Ù…Ø±ÙˆØ±",
          Placeholder: "Ù…ÙØªØ§Ø­ OpenAI API",
        },

        Endpoint: {
          Title: "Ø¹Ù†ÙˆØ§Ù† Ø§Ù„ÙˆØ§Ø¬Ù‡Ø©",
          SubTitle: "ÙŠØ¬Ø¨ Ø£Ù† ÙŠØ­ØªÙˆÙŠ Ø¹Ù„Ù‰ http(s):// Ø¨Ø®Ù„Ø§Ù Ø§Ù„Ø¹Ù†ÙˆØ§Ù† Ø§Ù„Ø§ÙØªØ±Ø§Ø¶ÙŠ",
        },
      },
      Azure: {
        ApiKey: {
          Title: "Ù…ÙØªØ§Ø­ Ø§Ù„ÙˆØ§Ø¬Ù‡Ø©",
          SubTitle: "Ø§Ø³ØªØ®Ø¯Ù… Ù…ÙØªØ§Ø­ Azure Ù…Ø®ØµØµ Ù„ØªØ¬Ø§ÙˆØ² Ù‚ÙŠÙˆØ¯ ÙƒÙ„Ù…Ø© Ø§Ù„Ù…Ø±ÙˆØ±",
          Placeholder: "Ù…ÙØªØ§Ø­ Azure API",
        },

        Endpoint: {
          Title: "Ø¹Ù†ÙˆØ§Ù† Ø§Ù„ÙˆØ§Ø¬Ù‡Ø©",
          SubTitle: "Ù…Ø«Ø§Ù„:",
        },

        ApiVerion: {
          Title: "Ø¥ØµØ¯Ø§Ø± Ø§Ù„ÙˆØ§Ø¬Ù‡Ø© (azure api version)",
          SubTitle: "Ø§Ø®ØªØ± Ø¥ØµØ¯Ø§Ø±Ù‹Ø§ Ù…Ø¹ÙŠÙ†Ù‹Ø§",
        },
      },
      Anthropic: {
        ApiKey: {
          Title: "Ù…ÙØªØ§Ø­ Ø§Ù„ÙˆØ§Ø¬Ù‡Ø©",
          SubTitle: "Ø§Ø³ØªØ®Ø¯Ù… Ù…ÙØªØ§Ø­ Anthropic Ù…Ø®ØµØµ Ù„ØªØ¬Ø§ÙˆØ² Ù‚ÙŠÙˆØ¯ ÙƒÙ„Ù…Ø© Ø§Ù„Ù…Ø±ÙˆØ±",
          Placeholder: "Ù…ÙØªØ§Ø­ Anthropic API",
        },

        Endpoint: {
          Title: "Ø¹Ù†ÙˆØ§Ù† Ø§Ù„ÙˆØ§Ø¬Ù‡Ø©",
          SubTitle: "Ù…Ø«Ø§Ù„:",
        },

        ApiVerion: {
          Title: "Ø¥ØµØ¯Ø§Ø± Ø§Ù„ÙˆØ§Ø¬Ù‡Ø© (claude api version)",
          SubTitle: "Ø§Ø®ØªØ± Ø¥ØµØ¯Ø§Ø± API Ù…Ø­Ø¯Ø¯",
        },
      },
      Google: {
        ApiKey: {
          Title: "Ù…ÙØªØ§Ø­ API",
          SubTitle: "Ø§Ø­ØµÙ„ Ø¹Ù„Ù‰ Ù…ÙØªØ§Ø­ API Ø§Ù„Ø®Ø§Øµ Ø¨Ùƒ Ù…Ù† Google AI",
          Placeholder: "Ø£Ø¯Ø®Ù„ Ù…ÙØªØ§Ø­ Google AI Studio API",
        },

        Endpoint: {
          Title: "Ø¹Ù†ÙˆØ§Ù† Ø§Ù„Ù†Ù‡Ø§ÙŠØ©",
          SubTitle: "Ù…Ø«Ø§Ù„:",
        },

        ApiVersion: {
          Title: "Ø¥ØµØ¯Ø§Ø± API (Ù…Ø®ØµØµ Ù„Ù€ gemini-pro)",
          SubTitle: "Ø§Ø®ØªØ± Ø¥ØµØ¯Ø§Ø± API Ù…Ø¹ÙŠÙ†",
        },
        GoogleSafetySettings: {
          Title: "Ù…Ø³ØªÙˆÙ‰ ØªØµÙÙŠØ© Ø§Ù„Ø£Ù…Ø§Ù† Ù…Ù† Google",
          SubTitle: "ØªØ¹ÙŠÙŠÙ† Ù…Ø³ØªÙˆÙ‰ ØªØµÙÙŠØ© Ø§Ù„Ù…Ø­ØªÙˆÙ‰",
        },
      },
      Baidu: {
        ApiKey: {
          Title: "Ù…ÙØªØ§Ø­ API",
          SubTitle: "Ø§Ø³ØªØ®Ø¯Ù… Ù…ÙØªØ§Ø­ Baidu API Ù…Ø®ØµØµ",
          Placeholder: "Ù…ÙØªØ§Ø­ Baidu API",
        },
        SecretKey: {
          Title: "Ø§Ù„Ù…ÙØªØ§Ø­ Ø§Ù„Ø³Ø±ÙŠ",
          SubTitle: "Ø§Ø³ØªØ®Ø¯Ù… Ù…ÙØªØ§Ø­ Baidu Secret Ù…Ø®ØµØµ",
          Placeholder: "Ù…ÙØªØ§Ø­ Baidu Secret",
        },
        Endpoint: {
          Title: "Ø¹Ù†ÙˆØ§Ù† Ø§Ù„ÙˆØ§Ø¬Ù‡Ø©",
          SubTitle: "Ù„Ø§ ÙŠØ¯Ø¹Ù… Ø§Ù„ØªØ®ØµÙŠØµØŒ Ø§Ù†ØªÙ‚Ù„ Ø¥Ù„Ù‰ .env Ù„Ù„ØªÙƒÙˆÙŠÙ†",
        },
      },
      ByteDance: {
        ApiKey: {
          Title: "Ù…ÙØªØ§Ø­ Ø§Ù„ÙˆØ§Ø¬Ù‡Ø©",
          SubTitle: "Ø§Ø³ØªØ®Ø¯Ù… Ù…ÙØªØ§Ø­ ByteDance API Ù…Ø®ØµØµ",
          Placeholder: "Ù…ÙØªØ§Ø­ ByteDance API",
        },
        Endpoint: {
          Title: "Ø¹Ù†ÙˆØ§Ù† Ø§Ù„ÙˆØ§Ø¬Ù‡Ø©",
          SubTitle: "Ù…Ø«Ø§Ù„:",
        },
      },
      Alibaba: {
        ApiKey: {
          Title: "Ù…ÙØªØ§Ø­ Ø§Ù„ÙˆØ§Ø¬Ù‡Ø©",
          SubTitle: "Ø§Ø³ØªØ®Ø¯Ù… Ù…ÙØªØ§Ø­ Alibaba Cloud API Ù…Ø®ØµØµ",
          Placeholder: "Ù…ÙØªØ§Ø­ Alibaba Cloud API",
        },
        Endpoint: {
          Title: "Ø¹Ù†ÙˆØ§Ù† Ø§Ù„ÙˆØ§Ø¬Ù‡Ø©",
          SubTitle: "Ù…Ø«Ø§Ù„:",
        },
      },
      AI302: {
        ApiKey: {
          Title: "Ù…ÙØªØ§Ø­ 302.AI API",
          SubTitle: "Ø§Ø³ØªØ®Ø¯Ù… Ù…ÙØªØ§Ø­ 302.AI API Ù…Ø®ØµØµ",
          Placeholder: "Ù…ÙØªØ§Ø­ 302.AI API",
        },
        Endpoint: {
          Title: "Ø¹Ù†ÙˆØ§Ù† Ø§Ù„ÙˆØ§Ø¬Ù‡Ø©",
          SubTitle: "Ù…Ø«Ø§Ù„:",
        },
      },
      CustomModel: {
        Title: "Ø§Ø³Ù… Ø§Ù„Ù†Ù…ÙˆØ°Ø¬ Ø§Ù„Ù…Ø®ØµØµ",
        SubTitle: "Ø£Ø¶Ù Ø®ÙŠØ§Ø±Ø§Øª Ù†Ù…ÙˆØ°Ø¬ Ù…Ø®ØµØµØŒ Ù…ÙØµÙˆÙ„Ø© Ø¨ÙÙˆØ§ØµÙ„ Ø¥Ù†Ø¬Ù„ÙŠØ²ÙŠØ©",
      },
    },

    Model: "Ø§Ù„Ù†Ù…ÙˆØ°Ø¬",
    CompressModel: {
      Title: "Ù†Ù…ÙˆØ°Ø¬ Ø§Ù„Ø¶ØºØ·",
      SubTitle: "Ø§Ù„Ù†Ù…ÙˆØ°Ø¬ Ø§Ù„Ù…Ø³ØªØ®Ø¯Ù… Ù„Ø¶ØºØ· Ø§Ù„Ø³Ø¬Ù„ Ø§Ù„ØªØ§Ø±ÙŠØ®ÙŠ",
    },
    Temperature: {
      Title: "Ø§Ù„Ø¹Ø´ÙˆØ§Ø¦ÙŠØ© (temperature)",
      SubTitle: "ÙƒÙ„Ù…Ø§ Ø²Ø§Ø¯Øª Ø§Ù„Ù‚ÙŠÙ…Ø©ØŒ Ø²Ø§Ø¯Øª Ø§Ù„Ø¹Ø´ÙˆØ§Ø¦ÙŠØ© ÙÙŠ Ø§Ù„Ø±Ø¯ÙˆØ¯",
    },
    TopP: {
      Title: "Ø¹ÙŠÙ†Ø§Øª Ø§Ù„Ù†ÙˆØ§Ø© (top_p)",
      SubTitle: "Ù…Ø´Ø§Ø¨Ù‡ Ù„Ù„Ø¹Ø´ÙˆØ§Ø¦ÙŠØ© ÙˆÙ„ÙƒÙ† Ù„Ø§ ØªØºÙŠØ±Ù‡ Ù…Ø¹ Ø§Ù„Ø¹Ø´ÙˆØ§Ø¦ÙŠØ©",
    },
    MaxTokens: {
      Title: "Ø­Ø¯ Ø£Ù‚ØµÙ‰ Ù„Ù„Ø±Ù…ÙˆØ² Ù„ÙƒÙ„ Ø±Ø¯ (max_tokens)",
      SubTitle: "Ø£Ù‚ØµÙ‰ Ø¹Ø¯Ø¯ Ù„Ù„Ø±Ù…ÙˆØ² ÙÙŠ ØªÙØ§Ø¹Ù„ ÙˆØ§Ø­Ø¯",
    },
    PresencePenalty: {
      Title: "ØªØ¬Ø¯Ø¯ Ø§Ù„Ù…ÙˆØ¶ÙˆØ¹ (presence_penalty)",
      SubTitle: "ÙƒÙ„Ù…Ø§ Ø²Ø§Ø¯Øª Ø§Ù„Ù‚ÙŠÙ…Ø©ØŒ Ø²Ø§Ø¯Øª Ø§Ø­ØªÙ…Ø§Ù„ÙŠØ© Ø§Ù„ØªÙˆØ³Ø¹ ÙÙŠ Ù…ÙˆØ§Ø¶ÙŠØ¹ Ø¬Ø¯ÙŠØ¯Ø©",
    },
    FrequencyPenalty: {
      Title: "Ø¹Ù‚ÙˆØ¨Ø© Ø§Ù„ØªÙƒØ±Ø§Ø± (frequency_penalty)",
      SubTitle: "ÙƒÙ„Ù…Ø§ Ø²Ø§Ø¯Øª Ø§Ù„Ù‚ÙŠÙ…Ø©ØŒ Ø²Ø§Ø¯Øª Ø§Ø­ØªÙ…Ø§Ù„ÙŠØ© ØªÙ‚Ù„ÙŠÙ„ ØªÙƒØ±Ø§Ø± Ø§Ù„ÙƒÙ„Ù…Ø§Øª",
    },
  },
  Store: {
    DefaultTopic: "Ø¯Ø±Ø¯Ø´Ø© Ø¬Ø¯ÙŠØ¯Ø©",
    BotHello: "ÙƒÙŠÙ ÙŠÙ…ÙƒÙ†Ù†ÙŠ Ù…Ø³Ø§Ø¹Ø¯ØªÙƒØŸ",
    Error: "Ø­Ø¯Ø« Ø®Ø·Ø£ØŒ ÙŠØ±Ø¬Ù‰ Ø§Ù„Ù…Ø­Ø§ÙˆÙ„Ø© Ù…Ø±Ø© Ø£Ø®Ø±Ù‰ Ù„Ø§Ø­Ù‚Ù‹Ø§",
    Prompt: {
      History: (content: string) =>
        "Ù‡Ø°Ø§ Ù…Ù„Ø®Øµ Ù„Ù„Ø¯Ø±Ø¯Ø´Ø© Ø§Ù„Ø³Ø§Ø¨Ù‚Ø© ÙƒÙ†Ù‚Ø·Ø© Ø§Ù†Ø·Ù„Ø§Ù‚: " + content,
      Topic:
        "Ø§Ø³ØªØ®Ø¯Ù… Ø£Ø±Ø¨Ø¹ Ø¥Ù„Ù‰ Ø®Ù…Ø³ ÙƒÙ„Ù…Ø§Øª Ù„Ø¥Ø±Ø¬Ø§Ø¹ Ù…Ù„Ø®Øµ Ù…Ø®ØªØµØ± Ù„Ù‡Ø°Ù‡ Ø§Ù„Ø¬Ù…Ù„Ø©ØŒ Ø¨Ø¯ÙˆÙ† Ø´Ø±Ø­ØŒ Ø¨Ø¯ÙˆÙ† Ø¹Ù„Ø§Ù…Ø§Øª ØªØ±Ù‚ÙŠÙ…ØŒ Ø¨Ø¯ÙˆÙ† ÙƒÙ„Ù…Ø§Øª ØªØ¹Ø¨ÙŠØ±ÙŠØ©ØŒ Ø¨Ø¯ÙˆÙ† Ù†Øµ Ø¥Ø¶Ø§ÙÙŠØŒ Ø¨Ø¯ÙˆÙ† ØªÙ†Ø³ÙŠÙ‚ Ø¹Ø±ÙŠØ¶ØŒ Ø¥Ø°Ø§ Ù„Ù… ÙŠÙƒÙ† Ù‡Ù†Ø§Ùƒ Ù…ÙˆØ¶ÙˆØ¹ØŒ ÙŠØ±Ø¬Ù‰ Ø§Ù„Ø¹ÙˆØ¯Ø© Ø¥Ù„Ù‰ 'Ø¯Ø±Ø¯Ø´Ø© Ø¹Ø§Ù…Ø©'",
      Summarize:
        "Ù‚Ù… Ø¨ØªÙ„Ø®ÙŠØµ Ù…Ø­ØªÙˆÙ‰ Ø§Ù„Ø¯Ø±Ø¯Ø´Ø© Ø¨Ø§Ø®ØªØµØ§Ø±ØŒ Ù„Ø§Ø³ØªØ®Ø¯Ø§Ù…Ù‡ ÙƒØ¥Ø´Ø§Ø±Ø© Ø³ÙŠØ§Ù‚ÙŠØ© Ù„Ø§Ø­Ù‚Ø©ØŒ Ø§Ø¬Ø¹Ù„Ù‡Ø§ ÙÙŠ Ø­Ø¯ÙˆØ¯ 200 ÙƒÙ„Ù…Ø©",
    },
  },
  Copy: {
    Success: "ØªÙ… Ø§Ù„ÙƒØªØ§Ø¨Ø© Ø¥Ù„Ù‰ Ø§Ù„Ø­Ø§ÙØ¸Ø©",
    Failed: "ÙØ´Ù„ Ø§Ù„Ù†Ø³Ø®ØŒ ÙŠØ±Ø¬Ù‰ Ù…Ù†Ø­ Ø£Ø°ÙˆÙ†Ø§Øª Ø§Ù„Ø­Ø§ÙØ¸Ø©",
  },
  Download: {
    Success: "ØªÙ… ØªÙ†Ø²ÙŠÙ„ Ø§Ù„Ù…Ø­ØªÙˆÙ‰ Ø¥Ù„Ù‰ Ù…Ø¬Ù„Ø¯Ùƒ.",
    Failed: "ÙØ´Ù„ Ø§Ù„ØªÙ†Ø²ÙŠÙ„.",
  },
  Context: {
    Toast: (x: any) => `ÙŠØ­ØªÙˆÙŠ Ø¹Ù„Ù‰ ${x} Ø¥Ø´Ø¹Ø§Ø±Ø§Øª Ù…Ø®ØµØµØ©`,
    Edit: "Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª Ø§Ù„Ø¯Ø±Ø¯Ø´Ø© Ø§Ù„Ø­Ø§Ù„ÙŠØ©",
    Add: "Ø¥Ø¶Ø§ÙØ© Ø¯Ø±Ø¯Ø´Ø© Ø¬Ø¯ÙŠØ¯Ø©",
    Clear: "ØªÙ… Ù…Ø³Ø­ Ø§Ù„Ø³ÙŠØ§Ù‚",
    Revert: "Ø§Ø³ØªØ¹Ø§Ø¯Ø© Ø§Ù„Ø³ÙŠØ§Ù‚",
  },
  Plugin: {
    Name: "Ø§Ù„Ø¥Ø¶Ø§ÙØ§Øª",
  },
  FineTuned: {
    Sysmessage: "Ø£Ù†Øª Ù…Ø³Ø§Ø¹Ø¯",
  },
  SearchChat: {
    Name: "Ø¨Ø­Ø«",
    Page: {
      Title: "Ø§Ù„Ø¨Ø­Ø« ÙÙŠ Ø³Ø¬Ù„Ø§Øª Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
      Search: "Ø£Ø¯Ø®Ù„ ÙƒÙ„Ù…Ø§Øª Ø§Ù„Ø¨Ø­Ø«",
      NoResult: "Ù„Ù… ÙŠØªÙ… Ø§Ù„Ø¹Ø«ÙˆØ± Ø¹Ù„Ù‰ Ù†ØªØ§Ø¦Ø¬",
      NoData: "Ù„Ø§ ØªÙˆØ¬Ø¯ Ø¨ÙŠØ§Ù†Ø§Øª",
      Loading: "Ø¬Ø§Ø±Ù Ø§Ù„ØªØ­Ù…ÙŠÙ„",

      SubTitle: (count: number) => `ØªÙ… Ø§Ù„Ø¹Ø«ÙˆØ± Ø¹Ù„Ù‰ ${count} Ù†ØªØ§Ø¦Ø¬`,
    },
    Item: {
      View: "Ø¹Ø±Ø¶",
    },
  },
  Mask: {
    Name: "Ø§Ù„Ù‚Ù†Ø§Ø¹",
    Page: {
      Title: "Ø£Ù‚Ù†Ø¹Ø© Ø§Ù„Ø£Ø¯ÙˆØ§Ø± Ø§Ù„Ù…Ø®ØµØµØ©",
      SubTitle: (count: number) => `${count} ØªØ¹Ø±ÙŠÙ Ù„Ø¯ÙˆØ± Ù…Ø®ØµØµ`,
      Search: "Ø¨Ø­Ø« Ø¹Ù† Ù‚Ù†Ø§Ø¹ Ø§Ù„Ø¯ÙˆØ±",
      Create: "Ø¥Ù†Ø´Ø§Ø¡ Ø¬Ø¯ÙŠØ¯",
    },
    Item: {
      Info: (count: number) => `ÙŠØ­ØªÙˆÙŠ Ø¹Ù„Ù‰ ${count} Ù…Ø­Ø§Ø¯Ø«Ø§Øª Ù…Ø®ØµØµØ©`,
      Chat: "Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
      View: "Ø¹Ø±Ø¶",
      Edit: "ØªØ­Ø±ÙŠØ±",
      Delete: "Ø­Ø°Ù",
      DeleteConfirm: "ØªØ£ÙƒÙŠØ¯ Ø§Ù„Ø­Ø°ÙØŸ",
    },
    EditModal: {
      Title: (readonly: boolean) =>
        `ØªØ­Ø±ÙŠØ± Ø§Ù„Ù‚Ù†Ø§Ø¹ Ø§Ù„Ù…Ø®ØµØµ ${readonly ? " (Ù„Ù„Ù‚Ø±Ø§Ø¡Ø© ÙÙ‚Ø·)" : ""}`,
      Download: "ØªÙ†Ø²ÙŠÙ„ Ø§Ù„Ù‚Ù†Ø§Ø¹ Ø§Ù„Ù…Ø®ØµØµ",
      Clone: "Ø§Ø³ØªÙ†Ø³Ø§Ø® Ø§Ù„Ù‚Ù†Ø§Ø¹",
    },
    Config: {
      Avatar: "ØµÙˆØ±Ø© Ø§Ù„Ø¯ÙˆØ±",
      Name: "Ø§Ø³Ù… Ø§Ù„Ø¯ÙˆØ±",
      Sync: {
        Title: "Ø§Ø³ØªØ®Ø¯Ø§Ù… Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª Ø§Ù„Ø¹Ø§Ù„Ù…ÙŠØ©",
        SubTitle: "Ù‡Ù„ ØªØ³ØªØ®Ø¯Ù… Ø§Ù„Ø¯Ø±Ø¯Ø´Ø© Ø§Ù„Ø­Ø§Ù„ÙŠØ© Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª Ø§Ù„Ø¹Ø§Ù„Ù…ÙŠØ© Ù„Ù„Ù†Ù…ÙˆØ°Ø¬",
        Confirm:
          "Ø³ØªØªÙ… Ø§Ù„ÙƒØªØ§Ø¨Ø© ÙÙˆÙ‚ Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª Ø§Ù„Ù…Ø®ØµØµØ© Ù„Ù„Ø¯Ø±Ø¯Ø´Ø© Ø§Ù„Ø­Ø§Ù„ÙŠØ© ØªÙ„Ù‚Ø§Ø¦ÙŠÙ‹Ø§ØŒ ØªØ£ÙƒÙŠØ¯ ØªÙØ¹ÙŠÙ„ Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª Ø§Ù„Ø¹Ø§Ù„Ù…ÙŠØ©ØŸ",
      },
      HideContext: {
        Title: "Ø¥Ø®ÙØ§Ø¡ Ø§Ù„Ù…Ø­Ø§Ø¯Ø«Ø§Øª Ø§Ù„Ù…Ø®ØµØµØ©",
        SubTitle: "Ø¨Ø¹Ø¯ Ø§Ù„Ø¥Ø®ÙØ§Ø¡ØŒ Ù„Ù† ØªØ¸Ù‡Ø± Ø§Ù„Ù…Ø­Ø§Ø¯Ø«Ø§Øª Ø§Ù„Ù…Ø®ØµØµØ© ÙÙŠ ÙˆØ§Ø¬Ù‡Ø© Ø§Ù„Ø¯Ø±Ø¯Ø´Ø©",
      },
      Share: {
        Title: "Ù…Ø´Ø§Ø±ÙƒØ© Ù‡Ø°Ø§ Ø§Ù„Ù‚Ù†Ø§Ø¹",
        SubTitle: "Ø¥Ù†Ø´Ø§Ø¡ Ø±Ø§Ø¨Ø· Ù…Ø¨Ø§Ø´Ø± Ù„Ù‡Ø°Ø§ Ø§Ù„Ù‚Ù†Ø§Ø¹",
        Action: "Ù†Ø³Ø® Ø§Ù„Ø±Ø§Ø¨Ø·",
      },
    },
  },
  NewChat: {
    Return: "Ø§Ù„Ø¹ÙˆØ¯Ø©",
    Skip: "Ø¨Ø¯Ø¡ Ø§Ù„Ø¢Ù†",
    NotShow: "Ø¹Ø¯Ù… Ø§Ù„Ø¹Ø±Ø¶ Ù…Ø±Ø© Ø£Ø®Ø±Ù‰",
    ConfirmNoShow:
      "ØªØ£ÙƒÙŠØ¯ Ø¥Ù„ØºØ§Ø¡ Ø§Ù„Ø¹Ø±Ø¶ØŸ Ø¨Ø¹Ø¯ Ø§Ù„Ø¥Ù„ØºØ§Ø¡ØŒ ÙŠÙ…ÙƒÙ†Ùƒ Ø¥Ø¹Ø§Ø¯Ø© ØªÙØ¹ÙŠÙ„Ù‡ ÙÙŠ Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª ÙÙŠ Ø£ÙŠ ÙˆÙ‚Øª.",
    Title: "Ø§Ø®ØªØ± Ù‚Ù†Ø§Ø¹Ù‹Ø§",
    SubTitle: "Ø§Ø¨Ø¯Ø£ Ø§Ù„Ø¢Ù† ÙˆØªÙØ§Ø¹Ù„ Ù…Ø¹ Ø§Ù„Ø£ÙÙƒØ§Ø± Ø®Ù„Ù Ø§Ù„Ù‚Ù†Ø§Ø¹",
    More: "Ø¹Ø±Ø¶ Ø§Ù„ÙƒÙ„",
  },

  URLCommand: {
    Code: "ØªÙ… Ø§Ù„ÙƒØ´Ù Ø¹Ù† Ø±Ù…Ø² ÙˆØµÙˆÙ„ ÙÙŠ Ø§Ù„Ø±Ø§Ø¨Ø·ØŒ Ù‡Ù„ ØªØ±ÙŠØ¯ ØªØ¹Ø¨Ø¦ØªÙ‡ ØªÙ„Ù‚Ø§Ø¦ÙŠÙ‹Ø§ØŸ",
    Settings: "ØªÙ… Ø§Ù„ÙƒØ´Ù Ø¹Ù† Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª Ù…Ø³Ø¨Ù‚Ø© ÙÙŠ Ø§Ù„Ø±Ø§Ø¨Ø·ØŒ Ù‡Ù„ ØªØ±ÙŠØ¯ ØªØ¹Ø¨Ø¦ØªÙ‡Ø§ ØªÙ„Ù‚Ø§Ø¦ÙŠÙ‹Ø§ØŸ",
  },

  UI: {
    Confirm: "ØªØ£ÙƒÙŠØ¯",
    Cancel: "Ø¥Ù„ØºØ§Ø¡",
    Close: "Ø¥ØºÙ„Ø§Ù‚",
    Create: "Ø¥Ù†Ø´Ø§Ø¡",
    Edit: "ØªØ­Ø±ÙŠØ±",
    Export: "ØªØµØ¯ÙŠØ±",
    Import: "Ø§Ø³ØªÙŠØ±Ø§Ø¯",
    Sync: "Ù…Ø²Ø§Ù…Ù†Ø©",
    Config: "ØªÙƒÙˆÙŠÙ†",
  },
  Exporter: {
    Description: {
      Title: "ÙÙ‚Ø· Ø§Ù„Ø±Ø³Ø§Ø¦Ù„ Ø¨Ø¹Ø¯ Ù…Ø³Ø­ Ø§Ù„Ø³ÙŠØ§Ù‚ Ø³ÙŠØªÙ… Ø¹Ø±Ø¶Ù‡Ø§",
    },
    Model: "Ø§Ù„Ù†Ù…ÙˆØ°Ø¬",
    Messages: "Ø§Ù„Ø±Ø³Ø§Ø¦Ù„",
    Topic: "Ø§Ù„Ù…ÙˆØ¶ÙˆØ¹",
    Time: "Ø§Ù„ÙˆÙ‚Øª",
  },
};

export default ar;

